In [1]:
import pandas as pd

### Let us see how to import data from csv,API(JSON),SQL Database and hold it in a dataframe object.

In [2]:
df_movies = pd.read_csv("data/IMDb movies.csv")

In [3]:
df_movies.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
1,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0
2,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,420,$ 45000,NaN,NaN,NaN,24.0,3.0
3,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2019,NaN,NaN,NaN,NaN,28.0,14.0
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,438,NaN,NaN,NaN,NaN,12.0,5.0

In [4]:
df_movies.loc[4]

imdb_title_id                                                    tt0002199
title                    From the Manger to the Cross; or, Jesus of Naz...
original_title           From the Manger to the Cross; or, Jesus of Naz...
year                                                                  1912
date_published                                                        1913
genre                                                     Biography, Drama
duration                                                                60
country                                                                USA
language                                                           English
director                                                     Sidney Olcott
writer                                                       Gene Gauntier
production_company                                           Kalem Company
actors                   R. Henderson Bland, Percy Dyer, Gene Gauntier,...
description              An account of the life of Jesus Christ, based ...
avg_vote                                                               5.7
votes                                                                  438
budget                                                                 NaN
usa_gross_income                                                       NaN
worlwide_gross_income                                                  NaN
metascore                                                              NaN
reviews_from_users                                                      12
reviews_from_critics                                                     5
Name: 4, dtype: object

### Import a new csv creating an index this time round using column imdb_title_id

In [5]:
df_movies = pd.read_csv("data/IMDb movies.csv", index_col='imdb_title_id')

In [6]:
df_movies.head(2)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

In [7]:
df_test = pd.read_csv("data/IMDb movies.csv")

In [8]:
x = df_test['imdb_title_id']

In [9]:
x.count()==len(set(x))

True

In [10]:
df_movies.head(1)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0

### Importing Data from a REST API (i.e. JSON)
#### In Python we decode JSON into dictionaries

In [11]:
df_posts = pd.read_json("https://jsonplaceholder.typicode.com/posts")

In [12]:
df_posts['id'].count()== len(set(df_posts['id']))

True

_Check if any column returns true i.e. has unique values for each row._

In [13]:
df_posts.head(1)

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...

### The read_json method doesnt have the index_col argument, we therefore use set_index

In [14]:
df_posts.set_index('id', inplace=True)

In [15]:
df_posts.head(2)

,userId,title,body
id,,,
1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
2,1,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...

In [16]:
!pip install sqlalchemy psycopg2

Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (1.3.13)
Requirement already satisfied: psycopg2 in c:\users\hp\anaconda3\lib\site-packages (2.8.5)

In [17]:
import psycopg2 as ps

In [18]:
con = ps.connect("host=localhost user=postgres password=wagatagati12! dbname=inventory_management_system" )
df = pd.read_sql_query("SELECT EXTRACT(MONTH FROM s.created_at) as sales_month, quantity, selling_price, (quantity*selling_price)as total_sales from sales as s join inventories as i on s.invid=i.id ", con)
df.head()

   sales_month  quantity  selling_price  total_sales
0          6.0         1          98.04        98.04
1          1.0         1          98.04        98.04
2          3.0         1         119.39       119.39
3         10.0         1          72.06        72.06
4          6.0         1         118.57       118.57

In [19]:
df_movies.head(2)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

### Pre-requisites of EDA(Exploratory Data Analysis)i.e. Descriptive statistics. Data preparation/cleaning Steps are:

* Run df.info()to check column/row frequencies of null/non-noll values. 
* If more than half of the rows in a column has NONE/NA/Null values then we could drop the column.
* If the Null values are few less than half then we can replace them with mean/median/mode.
* Deal with duplicate values. Remove and keep only one.

### Performing Desctiptive Statistics
* Also run describe()method on your df. This will show frequency/mean/max/standard deviation/variance of continous values(numbers only.)
* Check the relstionship between (continous variables)i.e. once column and another

### Data Vizualization (charts)

In [20]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 81273 entries, tt0000574 to tt9914286
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   title                  81273 non-null  object
 1   original_title         81273 non-null  object
 2   year                   81273 non-null  int64
 3   date_published         81273 non-null  object
 4   genre                  81273 non-null  object
 5   duration               81273 non-null  int64
 6   country                81234 non-null  object
 7   language               80518 non-null  object
 8   director               81200 non-null  object
 9   writer                 79780 non-null  object
 10  production_company     76948 non-null  object
 11  actors                 81207 non-null  object
 12  description            78843 non-null  object
 13  avg_vote               81273 non-null  float64
 14  votes                  81273 non-null  int64
 15  budget                 22804 non-null  object
 16  usa_gross_income       15094 non-null  object
 17  worlwide_gross_income  29892 non-null  object
 18  metascore              12722 non-null  float64
 19  reviews_from_users     74196 non-null  float64
 20  reviews_from_critics   70286 non-null  float64
dtypes: float64(4), int64(3), object(14)
memory usage: 13.6+ MB

### Country has 39 null values How do we deal with this?

we replace the values with a measure of tendency since they are few. In this case we choose the mode (most common country) because the data type is object(string)

_N.B. if we say we needed the actors column in our objectives then we would have to remove all rows which do dont have actors._

_this would be the case if you are peforming qualitative analysis instead of quantitative analysis_

__Budget column has 22804 out of 81273 values (i.e. almost 72%) which are null. How would we deal with scenerio?__

we would drop the entire column since it contains too many null values

__How would we deal with reviews_from_users?__

we would replce the null values with the mean. The data type is integer

### 1. Clean up our coulumns and clean the duplicates

In [21]:
df_movies_one = pd.read_csv("data/imdb_data_100.csv", index_col='Rank')

In [22]:
df_movies_one.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [23]:
df_movies_one.rename(columns = {'Runtime (Minutes)': 'Runtime_Minutes',
                                'Revenue (Millions)':'Revenue_Millions'}, 
                     inplace=True)

In [24]:
df_movies_one.columns = [c.lower() for c in df_movies_one.columns]

In [25]:
df_movies_one.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

In [26]:
df_movies_one.shape

(1000, 11)

In [27]:
df_movies_one.drop_duplicates(keep='first', inplace=True)

In [28]:
df_movies_one.shape

(1000, 11)

### Create a temporary data frame, create duplicate values using append method

In [29]:
temp_df = df_movies_one.append(df_movies_one)

In [30]:
temp_df = temp_df.append(df_movies_one)

In [31]:
temp_df.shape

(3000, 11)

In [32]:
temp_df_one = temp_df.copy()

In [33]:
temp_df.drop_duplicates(inplace=True, keep='last')

In [34]:
temp_df.shape

(1000, 11)

In [35]:
temp_df_one.drop_duplicates(inplace=True, keep=False)

In [36]:
temp_df_one.shape

(0, 11)

In [37]:
df_movies.shape

(81273, 21)

In [38]:
df_movies_one.shape

(1000, 11)

In [39]:
df_comb = df_movies_one.append(df_movies)

In [40]:
df_comb.shape

(82273, 24)

In [41]:
df_comb.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore',
       'original_title', 'date_published', 'duration', 'country', 'language',
       'writer', 'production_company', 'avg_vote', 'budget',
       'usa_gross_income', 'worlwide_gross_income', 'reviews_from_users',
       'reviews_from_critics'],
      dtype='object')

In [42]:
df_movies.columns

Index(['title', 'original_title', 'year', 'date_published', 'genre',
       'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [43]:
df_movies_one.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

In [44]:
df_movies_one.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   title             1000 non-null   object
 1   genre             1000 non-null   object
 2   description       1000 non-null   object
 3   director          1000 non-null   object
 4   actors            1000 non-null   object
 5   year              1000 non-null   int64
 6   runtime_minutes   1000 non-null   int64
 7   rating            1000 non-null   float64
 8   votes             1000 non-null   int64
 9   revenue_millions  872 non-null    float64
 10  metascore         936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

### Dealing with null values

In [45]:
df_nulls = df_movies_one.isnull()

In [46]:
df_nulls.sum()

title                 0
genre                 0
description           0
director              0
actors                0
year                  0
runtime_minutes       0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

### Removes a row with 1  null values

In [73]:
d1 = df_movies_one.copy()

In [78]:
d1.dropna(inplace=True)

In [81]:
d1.shape

(838, 11)

In [82]:
df_movies_one.shape

(1000, 11)

### Removes a column with atleast 1 null values

In [77]:
d2 = df_movies_one.copy()

In [83]:
d2.dropna(axis=1, inplace=True)

In [84]:
d2.shape

(1000, 9)

### Imputation - Using mean to clean revenue and metascore

In [86]:
df_movies_one.shape

(1000, 11)

In [48]:
df_movies_one.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   title             1000 non-null   object
 1   genre             1000 non-null   object
 2   description       1000 non-null   object
 3   director          1000 non-null   object
 4   actors            1000 non-null   object
 5   year              1000 non-null   int64
 6   runtime_minutes   1000 non-null   int64
 7   rating            1000 non-null   float64
 8   votes             1000 non-null   int64
 9   revenue_millions  872 non-null    float64
 10  metascore         936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

In [52]:
revenue = df_movies_one['revenue_millions']

In [88]:
revenue.head(10)

Rank
1     333.13
2     126.46
3     138.12
4     270.32
5     325.02
6      45.13
7     151.06
8        NaN
9       8.01
10    100.01
Name: revenue_millions, dtype: float64

In [67]:
revenue_mean= revenue.mean()

In [68]:
revenue_mean

82.95637614678897

In [58]:
df_movies_one.isnull().sum()

title                 0
genre                 0
description           0
director              0
actors                0
year                  0
runtime_minutes       0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

In [60]:
d5 = df_movies_one.copy()

In [61]:
d5.shape

(1000, 11)

In [62]:
d5['revenue_millions'].fillna(d5['revenue_millions'].mean(),inplace=True)

In [70]:
d5['metascore'].fillna(d5['metascore'].mean(),inplace=True)

In [71]:
d5.isnull().sum()

title               0
genre               0
description         0
director            0
actors              0
year                0
runtime_minutes     0
rating              0
votes               0
revenue_millions    0
metascore           0
dtype: int64

In [72]:
d5.to_csv("data/imdb_1000_clean.csv")

In [92]:
d5['revenue_millions'].head(10)

Rank
1     333.130000
2     126.460000
3     138.120000
4     270.320000
5     325.020000
6      45.130000
7     151.060000
8      82.956376
9       8.010000
10    100.010000
Name: revenue_millions, dtype: float64